<?php

// a-z , A-Z , 0-9 , _


// اول اسم متغیر باید علامت دلار باشه
// $name;
// $NAME;
// حساس روی حروف بزرگ و کوچیک

// نامگذاری
// عدد اول اسم متغیر نباید باشه
//$1name;  اشتباهه
// $name_12;
// --------------------------------------------------------
// نوع نوشتار متغیر های دو بخشی

// $firstname;
// همه با حروف کوچیک

// $FirstName;
// حرف اول هر بخش بزرگ نوشته بشه
// پاسکال کیس

// $firstName;
// حرف اول بخش دوم بزرگ نوشته بشه
// کمل کیس camelCase

// $first_name;
// بخش هارو با استفاده از _ از هم جدا کنیم

// --------------------------------------------------------


// مقدار دهی به متغیر

// $name = "liam";

// نمایش مقدار متغیر

// echo $name;

// $newName = $name;

// echo $newName;

// --------------------------------------------------------

// ثابت ها
// تعریف ثایت 
// define برای تعریف
// پارامتر اول اسم ثابت 
// پارامتر دوم مقدار ثابت
// define('COLOR' , "red");
// echo COLOR;

// ثابت های جادویی در php

// echo PHP_INT_MAX;
// echo "<br>";
// echo PHP_INT_MIN;
// echo "<br>";
// echo __LINE__;
// echo "<br>";
// echo __DIR__;
// echo "<br>";
// echo __FILE__;

// --------------------------------------------------------


// انواع دیتا تایپ

// Scalars

// $name="zeinab";  //  "String"
// $name='zeinab';   // "String"
// echo $name;

// $age= 25;  //integer

// $price= 20.33;  //float/double

// $bool = true;  //boolean
// $bool = false;  //boolean

// Compound
// $numbers = [1,2, 'ali' ,true,23.55];   //array
// object


// Specials
// $nothing = null; //null
// res

// گرفتن نوع داده متغیر
// echo gettype($name);

// گرفتن اطلاعات بیشتر درباره مقدار متغیر
// echo var_dump($name);

// --------------------------------------------------------

// $x = 6;
// $y = 5;

// echo $x + $y;
// echo "<br>";
// echo $x * $y;
// echo "<br>";
// echo $x / $y;
// echo "<br>";
// echo $x - $y;
// echo "<br>";
// echo $x % $y;

//یدونه اضافه و کم کردن 
// echo ++$x;
// echo --$x;
// ابتدا کم یا اضافه میکنه و بعد  نمایش میده

// echo $x--;
// echo $x++;
// اگر علامت ها بعد از متغیر بیاد اول نمایش میده و بعد کم
// یا اضافه میکنه

// $x--;
// echo $x;

// Shortcuts
// $x = $y +$x; // ==>$x += $y
// $x += $y;
// echo "<br>";
// $x -= $y;
// echo "<br>";
// $x *= $y;
// echo "<br>";

// echo $x;


//  ترتیب اجرا
// echo 100 + 10 - 50 / 5 * 1;  //==> 100
// اول تقسیم دوم ضرب سوم جمع و در آخر تفریق انجام میشه

// در صورت حضور پرانتز
// اول عمل داخل پرانتز انجام میشه و ادامه مثل قبل

// echo 100 + (10 - 50) / 5 * 1; //==> 92



// --------------------------------------------------------

// تبدیل اعداد

// $x = '5';

// var_dump($x);
// var_dump((int)$x);
// var_dump(intval($x));


// $y = "ali";
//  var_dump((int)$y);


// $z = 12.8;
// var_dump((int)$z); //==> 12
// var_dump((float)$z); //==> 12.8
// var_dump(floatval($z)); //==> 12.8


// $n = 10;
// var_dump((string)$n);


// چک کردن اینکه متغیر از نوع int هست یا نه
// $s = 20.85;
// var_dump(is_int($s));
// var_dump( is_float($s));
// var_dump( is_numeric($s));
// اگر int و float و رشته عددی هم باشه true برمیگردونه


// --------------------------------------------------------

// توابع ریاضی

// قدرمطلق
// echo abs(-200);
// echo "<br>";
// // توان ...پارامتر اول خود عدد و پارامتر دوم توان عدد
// echo pow(2,3);
// echo "<br>";
// // جذر
// echo sqrt(16);
// echo "<br>";
// // بزرگترین عدد
// echo max(10,4,6,18);
// echo "<br>";
// // کوچکترین عدد
// echo min(10,4,6,18);
// echo "<br>";
// تابع رند کردن عدد
// echo round(5.6);
// echo "<br>";
// تابع رند کردن به بالا
// echo ceil(4.1);
// echo "<br>";
// تابع رند کردن به پایین
// echo floor(5.9);
// echo "<br>";


// تولید عدد رندوم
// پارامتر اول ابتدا و پارامتر دوم انتهای بازه
// echo rand(0,10);

// --------------------------------------------------------

// آشنایی به String
// $firstName = 'ali';
// $lastName = "sheikh";

// echo 'my name is $firstName $lastName';
// echo "my name is $firstName $lastName";
// در خط دوم مقدار متغیر نمایش داده میشه ولی در خط اول
// اسم خود متغیر قرار میگیره


// چسباندن چند string به هم

// $s = "hello";
// echo $s . "world";
// echo "<br>";
// echo "$s world";
// echo "<br>";
// echo $s . ' ' . "world";
// echo "<br>";
// echo $s . " world";
// echo "<br>";
// echo "{$s}world";


// --------------------------------------------------------

// توابع String


// $str = "hello world";
 
// دسترسی به کاراکتر
// echo $str[2];

// // تغییر یک کاراکتر
// $str[2] = 'e';
// echo $str;
// شمردن کلمات
// echo str_word_count($str);
// طول خود رشته ....تعداد کاراکتر ها به همراه فاصله
// echo strlen($str);
// برش رشته از ایندکس مشخص شده
// echo substr($str,3);
// ایندکس های ابتدا و انتها رو هم میشه مشخص کرد
// echo substr($str,6 ,3);

// برگراندن ایندکس کاراکتر و اگر از اون کاراکتر دوتا
// وجودد داشته باشه ایندکس اولی ر برمیگردونه
// حساس به حروف کوچک و بزرگ
// echo strpos($str , 'o');
// اگر بخوایم یک کاراکتر دومیش رو برگردونه باید مشخص کنیم
// از کدوم ایندکس به بعد رو بگرده
// echo strpos($str , 'o',5);
// // اگر بخوایم به حروف بزرگ و کوچک حساس نباشه از تابع زیر استفاده میکنیم
// echo stripos($str ,'O');
// // اگر بخوایم از انتها دنبالش بگرده
// echo strrpos($str ,'o');
// // هم از انتها و هم اینکه حساس نیست
// echo strripos($str ,'o');


// جایگزین کردن
// پارامتر اول کلمی ای که میخوایم برش داریم و پارامتر دوم
// کلمه ای که میخوایم جاش بذاریم
// پارامتر سوم مشخص میکنه توی چه متغیری این کارو انجام بده
// echo str_replace("world", "webprog",$str);

// چک کردن کاراکتر یا متن یا کلمه
// var_dump( str_contains($str , "ll"));
//چک کردن شروع رشته با
// var_dump( str_starts_with($str , "h"));

// چک کردن پایان رشته با
// var_dump( str_ends_with($str , "d"));


// تموم حروف رو بزرگ کنیم
// echo strtoupper($str);

// تموم حروف رو به کوچیک تبدیل میکنه
// echo strtolower($str);



// حرف اول هر کلمه رو بزرگ کنه
// echo ucwords($str);
// حرف اول کلمه اول رو بزرگ میکنه
// echo ucfirst($str);
// اولین حرف کلمه اول رو کوچیک کنه
// echo lcfirst($str);

// فرمت کردن اعداد

// $amount = 1000000;
// سه رقم سه رقم کاما گذاشتن
// echo number_format($amount);


// --------------------------------------------------------

//آشنایی با آرایه


// ایجاد آرایه 

// $numbers = array(1 ,"ali", true , null , 23.3,array(1,2));

// همه نوع دتایی میشه توش نوشته بشه 

// تعریف آرایه مدل1
// $numbers = array(1,2,3,4,5);

// echo "<pre>";
// print_r($numbers);

// echo $numbers[2];

// $numbers[1] ="two";
// echo "<pre>";
// print_r($numbers);

// تعریف ارایه مدل2
// $numbers2 = [5,7,3,6];
// echo "<pre>";
// print_r($numbers2);


// --------------------------------------------------------


// توابع آرایه
// $name = ["ali","sara","liam" ];
// اضافه کردن یه مقدار به آرایه 
// پارامتر اول اسم متغیر
// پارامتر دوم مقداری که میخواد به انتها اضافه بشه
// array_push($name , "nima");
// اضافه کردن یه مقدار به ابتدای آرایه
// array_unshift($name , "zhra ");
// echo "<pre>";
// print_r($name);


// حذف یه مقدار از انتهای آرایه
// array_pop($name);

// حذف یه مقدار از ابتدای ارایه
// array_shift($name);


// چک کردن وجود یه مقدار در ارایه
// var_dump(in_array("ali",$name));
// چک میکنه که وجود داره یا نه و در صورت وجود ایندکس مقدار
// رو برمیگردونه
// var_dump(array_search("ali", $name));
// echo "<pre>";
// print_r($name);


// مرتب کردن آرایه براساس حروف
// sort($name);
// معکوس sort
// rsort($name);

// echo "<pre>";
// print_r($name);
 


// --------------------------------------------------------

// توابع آرایه 2

// تبدیل استرینگ به آرایه
// $name = "ali,nima,sara";
// $arr = explode(',',$name);
// echo "<pre>";
// print_r($arr);

// تبدیل آرایه به استرینگ

// $letters = ["a", "b" , "c" , "d"];
// $str= implode('-',$letters);
// echo $str;


// مرج کردن دو آرایه 
// $num1= [1,2,3];
// $num2 = [9,8,6];
// $result = array_merge($num1,$num2);

// echo "<pre>";
// print_r($result);


// $num1= [1,2,3];
// $num2 = [9,8,6];
// $num3 =[2,2,3];
// $result = array_merge($num1,$num2,$num3);

// echo "<pre>";
// print_r($result);

// مقایشه دو ارایه و برگرداندن تفاوت


// $num1 = [1,2,3,4,5];
// $num2 = [1,4,6,8,10];


// مهمه که کدوم آرایه رو اول بذاریم
// در ارایه دوم و اول هر چی که مشترکه حذف میکنه و چیزهایی 
// که توی ارایه اول باقی مونده رو برمیگرداند
// $result = array_diff($num1,$num2);

// اگر ایندکس های متناظر مقدارشون یکی باشه اون هارو حذف میکنه 
// $result = array_diff_assoc($num1,$num2);

// echo "<pre>";
// print_r($result);

// --------------------------------------------------------


// آرایه های انجمنی
// $numbers = [6,7,5];

// میتونم key رو خودمون بسازیم
// $user =[
//     'name' => 'ali' 
//     , 'age' => 25
// ];


// برگرداندن مقدار در ارایه انجمنی
// echo $user['age'];

// تغییر مقدار در ارایه انجمنی
// $user['age'] = 30;

// اضافه کردن کلید و مقدار به آرایه انجمنی
// $user ['city'] = "gorgan";


// برگرداندن مقدار های آرایه انجمنی
// $result =array_values($user);

// برگرداندن کلید های ارایه انجمنی
// $result =array_keys($user);

// echo "<pre>";
// print_r($result);


// --------------------------------------------------------






